
/**
 * File Description/檔案描述: 切字串
 * @author JamesChang
 * @since 2020/4/27下午 04:59
 * @version 1.0
 **/
public class SunLongString {
    public static void main(String[] args){
        String longString = "童不好說先像趣電食容如差業使大下，說而能是要電因，和遊作易發國分眼人步突：能體而作改灣人被日。發依大不車由那它眼說人沒引才的觀上器，上現只別大信道低；際容外長難性改去過要了現！外值層里心建作子。後時手為紀有……道科方緊味人定能時工本這最你叫卻學靜講想盡所自，多我無稱題家父料上要育此他友：趣麼心，第是政壓怕、快運容是加常站子熱我？決節真發的落直足專出體食的我保速是水當時或手廣新日西第；沒雨致？本經生港間條關器服內士境上我條禮作。皮造前。\n" +
                "\n" +
                "經第少野足人小持一的員了海式議起果商？他受設親推；點兒的別要點生生有！委年家女而國之自民多行，制沒往己全動居長，條興得仍笑身認問上一個方最輕！友大大比務一所部？業亞聲母國過主：我市心。作立裝實山品千活嗎分他把事電跑得必長統都，家新父大治，生減非，坐一選任不的，家法門家：識善光態量收克更過始：系經原題？\n" +
                "\n" +
                "到女事是；財上連手利親等而區到密正畫政在以業界：史了不壓是提雜笑情！\n" +
                "\n" +
                "式起在。\n" +
                "\n" +
                "天有再你眾在，了可部書連用。\n" +
                "\n" +
                "視積和：業位基人地麼關新頭一能能素。\n" +
                "\n" +
                "年活顯的手；當之她成向情似我：報機已一，弟部水在為差心開出言：說談山，天請子本界分市受一。在來事工一知綠數第；地不五筆集已家臺。\n" +
                "\n" +
                "那後李修所好？爭因間三難物小一立修不智；著最策家建。量往可民世會夫領加的大舉行！當由親選行意大是由呢當名朋整作人改是；文正山有國有多，壓這裡企關。型的發收藝女大高、得動病究各的是早，一值看喜麼而前：表心機得找十。星灣入一型我學正育，時把農課，資富個、文記天究我越在說作數位，將不園那是裡前燈王必！我關舞學驚排親登合目像，關臺般。\n" +
                "\n" +
                "保清西美定神以體了受陸對……特地現苦行都拿濟有系標。\n" +
                "\n" +
                "間火的、會認皮神的個得香職房來面性園又魚，能心都造為記北歌發的玩已縣紅又真……起長相腳……生下意綠立政甚；人等雙認雖系差民定爭假氣色那於有慢年。\n" +
                "\n" +
                "先看自防境？這成們數大此已事由空。的技領流有什格是筆是對市經跑羅身；學師得之片健，輕合麼式，口死高，安不當安們想無護今能了，性關帶，英為成，依不德實產知商我支已常生然微有水園，已裡是支所受；的實重族他經聽日內強……與正能令；重學夠然巴一不王事球機上整城學！就組難識地般，朋管程：人改料，照原又下最，議表看全時整黨對支，車日中總好場本時？的我裡角體接了兒，口動是情題轉血不清，況為他失係有，當訴顯被。星得小眼車有。指會害玩目通如說歡車每我亞其然是生的然？過回傳領邊！日學問議機制製果的研該？拿頭一真山怎是對小費，入另自的，公案加個：相快性？指散的由星算公人方之她兒人神保是的新，個小接；立問紀小但你動人創訴產：因市持英世後味甚來；頭使勢道外家道法灣！\n" +
                "\n" +
                "一在依國了效會媽作器又頭上答技。主學你後識情水列代來復行育；時型品不高車消至們醫的哥？痛當說化必病果病今上自，力而山中長之一，年表不人財！速後火士是告親目……什靜動孩事個一動內格超大面百生？天晚大原直畫住然的別策回登子集。技的和國……吸會父但野出到流假道石成成有望德當難其，多要心活科種能日。";
        String colume1 = "";
        String colume2 = "";
        if(longString.length() >= 500){
            colume1 = longString.substring(0,500);
            colume2 = longString.substring(500,longString.length());
        }
        else{
            colume1 = longString;
        }
        System.out.println(colume1);
        System.out.println("============================");
        System.out.println(colume2);
    }
}

